// Задача 6. Напишите программу, которая принимает на вход
// принимает число и выдаёт, является ли число чётным
// (делиться ли оно на два без остатка).
// 4 -> два 
// -3 -> нет
// 7 -> нет

Console.WriteLine("Введите число");
int a = Convert.ToInt32(Console.ReadLine());

if a (% 2 == 0);
{
    Console.WriteLine("Число " + a + "чётное");
}
else
{
    Console.WriteLine($"Число: нечётное");
}